web/wsdl/notarialService.xml

<!--  Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}.  -->
<!--  Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}.  -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservice/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webservice/" name="WebServiceService">
<types>
<xsd:schema>
<xsd:import namespace="http://webservice/" schemaLocation="http://localhost:8080/ws/NotarialWebService?xsd=1"/>
</xsd:schema>
</types>
<message name="validation">
<part name="parameters" element="tns:validation"/>
</message>
<message name="validationResponse">
<part name="parameters" element="tns:validationResponse"/>
</message>
<portType name="WebService">
<operation name="validation">
<input wsam:Action="http://webservice/WebService/validationRequest" message="tns:validation"/>
<output wsam:Action="http://webservice/WebService/validationResponse" message="tns:validationResponse"/>
</operation>
</portType>
<binding name="WebServicePortBinding" type="tns:WebService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="validation">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="WebServiceService">
<port name="WebServicePort" binding="tns:WebServicePortBinding">
<soap:address location="http://localhost:8080/ws/NotarialWebService"/>
</port>
</service>
</definitions>